#include "main.h"



/**********************************************************************
函数功能：主函数
入口参数：无
返回参数：无
***********************************************************************/
int main(void)
{
	
	delay_init();				//延时函数初始化	  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//设置中断优先级分组为组2：2位抢占优先级，2位响应优先级
	uart_init(UAR1,115200);	 		//串口初始化为115200	
	LED_Init();					//LED端口初始化
	KEY_Init();					//按键初始化 	
	LCD_Init();					//LCD初始化
	
	TIM3_PWM_init(7199,0);		//定时器PWM波初始化，10KHz
	TIM1_IntInit(4999,71);		//初始化定时器1,用于5ms中断

	while(1)
	{
	}
}

